app/controllers/api/v1/admins_controller.rb

SELECT "admins".* FROM "admins" WHERE "admins"."email" = $1 LIMIT $2  [["email", "ola@mundo"], ["LIMIT", 1]]
---
    def login
        admin = Admin.find_by!(email: params[:email])