app/controllers/api/v1/languages_controller.rb

    def index
        languages = Language.all
---
SELECT "languages".* FROM "languages"

    def show
       language = Language.find(params[:id])
---
SELECT "languages".* FROM "languages" WHERE "languages"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def create
        language = Language.new(language_params)
        language.save!
---
INSERT INTO "languages" ("name", "teacher_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "python"], ["teacher_id", 1], ["created_at", "2021-10-05 04:07:15.325495"], ["updated_at", "2021-10-05 04:07:15.325495"]]

    def update
        language = Language.find(params[:id])
        language.update!(language_params)
---
SELECT "languages".* FROM "languages" WHERE "languages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "languages" SET "name" = $1, "updated_at" = $2 WHERE "languages"."id" = $3  [["name", "python"], ["updated_at", "2021-10-05 04:15:46.642030"], ["id", 1]]

    def delete
        language = Language.find(params[:id])
        language.destroy!
---
SELECT "languages".* FROM "languages" WHERE "languages"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "languages" WHERE "languages"."id" = $1  [["id", 3]]