app/controllers/api/v1/students_controller.rb

SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
       student = Student.find(params[:id])

INSERT INTO "students" ("name", "registration", "email", "birth", "teacher_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        student = Student.new(student_params)
        student.save!

SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "students" SET "name" = $1, "registration" = $2, "updated_at" = $3 WHERE "students"."id" = $4  [["name", "amanda canizo"], ["registration", "010101010"], ["updated_at", "2021-10-04 20:19:02.455124"], ["id", 6]]
---
    def update
        student = Student.find(params[:id])
        student.update!(student_params)

SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "students" WHERE "students"."id" = $1  [["id", 6]]
---
    def delete
        student = Student.find(params[:id])
        student.destroy!